In [3]:
from pandas import DataFrame
data={"Malayalam":[20,22,25,30,10],"English":[25,24,22,20,25],"Science":[20,22,20,20,21],"Maths":[30,29,22,25,3]}
data

{'Malayalam': [20, 22, 25, 30, 10],
 'English': [25, 24, 22, 20, 25],
 'Science': [20, 22, 20, 20, 21],
 'Maths': [30, 29, 22, 25, 3]}

In [4]:
frame=DataFrame(data)
frame

   Malayalam  English  Science  Maths
0         20       25       20     30
1         22       24       22     29
2         25       22       20     22
3         30       20       20     25
4         10       25       21      3

In [6]:
frame=frame.reindex(columns=["English","Science","Malayalam","Maths"])
frame

   English  Science  Malayalam  Maths
0       25       20         20     30
1       24       22         22     29
2       22       20         25     22
3       20       20         30     25
4       25       21         10      3

In [7]:
frame.sort_index(axis=1)

   English  Malayalam  Maths  Science
0       25         20     30       20
1       24         22     29       22
2       22         25     22       20
3       20         30     25       20
4       25         10      3       21

In [9]:
frame.sort_index(axis=1,ascending=False)

   Science  Maths  Malayalam  English
0       20     30         20       25
1       22     29         22       24
2       20     22         25       22
3       20     25         30       20
4       21      3         10       25

In [14]:
frame.sort_index(axis=1,ascending=True)

   English  Malayalam  Maths  Science
0       25         20     30       20
1       24         22     29       22
2       22         25     22       20
3       20         30     25       20
4       25         10      3       21

In [15]:
from pandas import Series
series=Series([44,40,50,49],index=["English","Science","Malayalam","Maths"])
series

English      44
Science      40
Malayalam    50
Maths        49
dtype: int64

In [16]:
series.sort_values()

Science      40
English      44
Maths        49
Malayalam    50
dtype: int64

In [17]:
frame.sort_values(by="English")

   English  Science  Malayalam  Maths
3       20       20         30     25
2       22       20         25     22
1       24       22         22     29
0       25       20         20     30
4       25       21         10      3

In [18]:
frame.sum()

English      116
Science      103
Malayalam    107
Maths        109
dtype: int64